Autodesk.Revit.DB.ViewSchedule.GetScheduleInstances(System.Int32)
Gets the instances ids of schedule or schedule segment.
Remarks:
The segment index value could be -1, it means to get schedule instances for the entire schedule.
segmentIndex:
Index of the segment.
Returns:
The array of schedule sheet instance elment ids of schedule or schedule segment.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The segment index should start from -1 and be less than the total segment count.
Since:
2022.1

Autodesk.Revit.DB.ViewSchedule.Split(System.Collections.Generic.IList{System.Double})
Splits the schedule into several segments by given height of each segment.
Remarks:
A schedule can be split only when it is not split yet.
A titleblock revision schedule cannot be split.
Once an internal schedule, which is used when keynote legend schedule are filtered by sheet, is split,
the segments will be placed on its sheet view immediately.
The height values are used to set the height limits of the schedule instances of each segment
except the last segment shown on the sheet view.
The height limit of the last segment cannot be set, because the height of the schedule instances of the last segment
will be determined by the schedule instances of previous segments and the height of the whole schedule.
All height values must be greater than 0.
Also check setSegmentHeight.
segmentHeights:
An array contains the height limit of each segment except the last segment.
The height is the value for segment body.
The height is Revit's internal units value.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The height of a schedule segment must be greater than 0 and no more than 30000 feet. The total segment count must be greater than 0 and less than 10000.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Revision schedules cannot be split.
-or-
A Keynote Legend schedule that filtered by sheet can't be split.
-or-
This ViewSchedule is split.
Since:
2022.1

Autodesk.Revit.DB.ViewSchedule.Split(System.Int32)
Splits the schedule into several segments by given segment number.
Remarks:
The segment number must be greater than 0.
A schedule can be split only when it is not split yet.
A titleblock revision schedule cannot be split.
Once an internal schedule, which is used when keynote legend schedule are filtered by sheet, is split,
the segments will be placed on its sheet view immediately.
After split, all segments will have even height limits based on the schedule height and segment number
except the last segment shown on the sheet view.
The height limit of the last segment cannot be set, because the height of the schedule
instances of the last segment will be determined by the schedule instances of previous
segments and the height of the whole schedule.
Check Autodesk.Revit.DB.ViewSchedule.SetSegmentHeight(System.Int32,System.Double) to see more about segment height.
segmentNumber:
The segment number.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The segment number must be greater than 1.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
Revision schedules cannot be split.
-or-
A Keynote Legend schedule that filtered by sheet can't be split.
-or-
This ViewSchedule is split.
Since:
2022.1